---
title: "GetColorEventArgs"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.UI*

```cs
public class GetColorEventArgs : EventArgs
```
## Properties

bool IncludeButtonColors
:

Color InputColor
:

Color SelectedColor
:

string Title
: