---
title: "Localization"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.UI*

```cs
public class Localization
```
## Properties

static int CurrentLanguageId
:
: since 6.0

static bool RunningAsEnglish
:
: since 6.0
## Methods

static string FormatArea(double area,UnitSystem units,DimensionStyle dimStyle,bool alternate)
: Format an Area string from a number
: since 7.0

static string FormatDistanceAndTolerance(double distance,UnitSystem units,DimensionStyle dimStyle,bool alternate)
:
: since 7.0

static string FormatNumber(double x,UnitSystem units,DistanceDisplayMode mode,int precision,bool appendUnitSystemName)
: Get a string version of a number in a given unit system / display mode.
: Returns - The formatted number.

static string FormatVolume(double volume,UnitSystem units,DimensionStyle dimStyle,bool alternate)
: Format a Volume string from a number
: since 7.0

static string LocalizeCommandName(string english)
: Commands that need to be localized should call this function.

static string LocalizeCommandName(string english,object assemblyOrObject)
:

static LocalizeStringPair LocalizeCommandOptionName(string english,int contextId)
:

static LocalizeStringPair LocalizeCommandOptionName(string english,object assemblyOrObject,int contextId)
:

static LocalizeStringPair LocalizeCommandOptionValue(string english,int contextId)
:

static LocalizeStringPair LocalizeCommandOptionValue(string english,object assemblyOrObject,int contextId)
:

static string LocalizeDialogItem(object assemblyOrObject,string key,string english)
: Look in the dialog item list for the specified key and return the translated
     localized string if the key is found otherwise return the English string.
: Returns - Look in the dialog item list for the specified key and return the translated
     localized string if the key is found otherwise return the English string.
: since 5.5

static void LocalizeForm(object formOrUserControl)
: Look in the dialog item list for the specified key and return the translated
     localized string if the key is found otherwise return the English string.
: since 6.0

static string LocalizeString(string english,int contextId)
: Returns localized version of a given English string. This function should be autogenerated by the
     RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
: Returns - The localized string.

static string LocalizeString(string english,object assemblyOrObject,int contextId)
: Returns localized version of a given English string. This function should be autogenerated by the
     RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
: Returns - The localized string.

static bool SetLanguageId(int id)
: Sets the Id used for Localization in RhinoCommon.  Only useful for when
     using RhinoCommon outside of the Rhino process
: Returns - True if the language id could be set

static string UnitSystemName(UnitSystem units,bool capitalize,bool singular,bool abbreviate)
: Gets localized unit system name.  Uses current application locale id.
: Returns - The unit system name.