---
title: "LocalizeStringPair"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.UI*

Pair of strings used for localization.
```cs
public class LocalizeStringPair
```
## Constructors

LocalizeStringPair(string english,string local)
:
## Properties

string English
:

string Local
:
## Methods

string ToString()
:
: since (unknown)