---
title: "MouseCallbackEventArgs"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.UI*

```cs
public class MouseCallbackEventArgs : System.ComponentModel.CancelEventArgs
```
## Properties

MouseButtons Button
:

bool CtrlKeyDown
:
: since 6.0

MouseButton MouseButton
:
: since 6.0

bool ShiftKeyDown
:
: since 6.0

RhinoView View
:

Point ViewportPoint
: