---
title: "MouseCallback"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.UI*

Used for intercepting mouse events in the Rhino views.
```cs
public class MouseCallback
```
## Properties

bool Enabled
: