---
title: "MouseCursor"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI*

Contains static methods to control the mouse icon.
```cs
public class MouseCursor
```
## Properties

static Point2d Location
: Retrieves the position of the mouse cursor, in screen coordinates
: since 5.8
## Methods

static void SetToolTip(string tooltip)
: Sets a cursor tooltip string shown next to the mouse cursor.
     Overrides all cursor tooltip panes.