---
title: "OptionsDialogPage"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.UI*

```cs
public class OptionsDialogPage : StackedDialogPage
```
## Methods

Commands.Result RunScript(RhinoDoc doc,RunMode mode)
: