---
title: "PanelIds"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI*

Standard Rhino panel Id's
```cs
public class PanelIds
```
## Properties

static Guid ContextHelp
: Rhino context sensitive help panel.

static Guid Display
:

static Guid Environment
: Rhino environment panel

static Guid GroundPlane
: Rhino ground plane panel

static Guid Layers
: Rhino Layer panel

static Guid Libraries
: Rhino render properties panel
: since 5.9

static Guid LightManager
: Rhino light manager panel

static Guid Materials
: Rhino material browser

static Guid Notes
: Rhino notes panel
: since 5.9

static Guid ObjectProperties
: Rhino object properties panel

static Guid Rendering
: Rhino rendering properties panel
: since 6.0

static Guid Sun
: Rhino sun panel

static Guid Texture
: Rhino texture panel
: since 5.3