---
title: "PanelEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI*

Panels.Show event arguments
```cs
public class PanelEventArgs : EventArgs
```
## Constructors

PanelEventArgs(Guid panelId,uint documentSerialNumber)
:
: since 6.0
## Properties

RhinoDoc Document
:
: since 6.0

uint DocumentSerialNumber
:
: since 6.0

Guid PanelId
: Class Id for panel being shown or hidden
: since 6.0