---
title: "RhinoHelp"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.UI*

Provides access to the built in Rhino help system
```cs
public class RhinoHelp
```
## Methods

static bool Show(string helpLink)
: Call this method to display standard Rhino help
: since 6.0