---
title: "RhinoPageInterop"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI*

For internal use only, provides access to unmanaged core
   Rhino.
```cs
public class RhinoPageInterop
```
## Methods

static IntPtr NewPropertiesPanelPagePointer(ObjectPropertiesPage page,uint rhinoDocRuntimeSn)
: For internal use only, provides access to unmanaged core
: since 6.0

static StackedDialogPage StackedDialogPageFromUnmanagedPointer(IntPtr pointer)
: For internal use only, provides access to unmanaged core
: since 6.4