---
title: "ShowPanelEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI*

Panels.Show event arguments
```cs
public class ShowPanelEventArgs : PanelEventArgs
```
## Constructors

ShowPanelEventArgs(Guid panelId,uint documentSerialNumber,bool show)
:
: since 6.0
## Properties

bool Show
: Will be True if showing or False if hiding
: since 6.0