---
title: "ToolbarFileCollection"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.UI*

```cs
public class ToolbarFileCollection : IEnumerable<ToolbarFile>
```
## Properties

static bool MruSidebarIsVisible
:

static bool SidebarIsVisible
:

int Count
: Number of open toolbar files
## Methods

ToolbarFile FindByName(string name,bool ignoreCase)
:

ToolbarFile FindByPath(string path)
:

IEnumerator<ToolbarFile> GetEnumerator()
:

ToolbarFile Open(string path)
: