---
title: "ToolbarGroup"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.UI*

```cs
public class ToolbarGroup
```
## Properties

Guid Id
:

bool IsDocked
:

string Name
:

bool Visible
: