---
title: "Toolbar"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.UI*

```cs
public class Toolbar
```
## Properties

static Size BitmapSize
:
: since 6.0

static Size TabSize
:
: since 6.0

Guid Id
:

string Name
: