---
title: "WaitCursor"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.UI*

```cs
public class WaitCursor : IDisposable
```
## Constructors

WaitCursor()
:
: since 5.1
## Methods

void Clear()
:
: since 5.1

void Dispose()
:
: since 5.1

void Set()
:
: since 5.1