---
title: "SimpleArrayArrayPoint3d"
date: 2020-03-11 15:29:43Z
draft: false
---

*Namespace: Rhino.Runtime.InteropWrappers*

Wrapper for ON_SimpleArray<ON_PolyLine*>, ON_SimpleArray<ON_3dPointArray*>
   If you are not writing C++ code then this class is not for you.
```cs
public class SimpleArrayArrayPoint3d : IDisposable
```
## Constructors

SimpleArrayArrayPoint3d()
: Initializes a new empty  instance.
: since 7.0
## Properties

int Count
: Gets the amount of polylines in this array.
: since 7.0
## Methods

IntPtr ConstPointer()
: Gets the const (immutable) pointer of this array.
: Returns - The const pointer.
: since 7.0

void Dispose()
: Actively reclaims unmanaged resources that this instance uses.
: since 7.0

IntPtr NonConstPointer()
: Gets the non-const pointer (for modification) of this array.
: Returns - The non-const pointer.
: since 7.0

int PointCountAt(int index)
: Gets the amount of points in a polyline.
: since 7.0