---
title: "DisplayRenderSettings"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.ChangeQueue*

ChangeQueue DisplayRenderSettings
```cs
public class DisplayRenderSettings
```
## Properties

bool CullBackFaces
: True if backfaces should be culled
: since 6.0

bool ForceFlatShading
: True if flat shading is forced
: since 6.0

bool SceneLightingOn
: True if scene lighting is enabled
: since 6.0