---
title: "DynamicObjectTransform"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.ChangeQueue*

ChangeQueue DynamicObject
```cs
public class DynamicObjectTransform
```
## Properties

uint MeshInstanceId
: Get the mesh instance id for this dynamic object.
: since 6.0

Transform Transform
: Transform for the DynamicObject
: since 6.0
## Methods

string ToString()
: String representation of DynamicObject
: since (unknown)