---
title: "GroundPlane"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.ChangeQueue*

ChangeQueue ground plane
```cs
public class GroundPlane
```
## Properties

double Altitude
: Get the altitude for ground plane
: since 6.0

uint Crc
: Get the checksum of this groundplane object
: since 6.0

bool Enabled
: Return True if ground plane is enabled
: since 6.0

bool IsShadowOnly
: Get True if ground plane should be shadow-only
: since 6.0

uint MaterialId
: The CRC / RenderHash of the material on this ground plane
: since 6.0

Vector2d TextureOffset
: Get texture offset on the ground plane
: since 6.0

double TextureRotation
: Get texture rotation on the ground plane
: since 6.0

Vector2d TextureScale
: Get texture scale on the ground plane
: since 6.0