---
title: "Light"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.ChangeQueue*

ChangeQueue Light change representation
```cs
public class Light
```
## Properties

Event ChangeType
: Get what type of light change this represents
: since 6.0

Light Data
: Get the actual light data
: since 6.0

Guid Id
: Get the light object id
: since 6.0

uint IdCrc
: Get CRC computed from Id
: since 6.0