---
title: "MappingChannelCollection"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.ChangeQueue*

MappingChannels for a Mesh
```cs
public class MappingChannelCollection
```
## Properties

IEnumerable<MappingChannel> Channels
: Enumerate all available channels in this mapping
: since 6.0

int Count
: Get count of MappingChannels in this collection
: since 6.0