---
title: "MappingChannel"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.ChangeQueue*

Mapping Channel for a ChangeQueue Mesh
```cs
public class MappingChannel
```
## Properties

Transform Local
: Local transform for the mapping
: since 6.0

TextureMapping Mapping
: Return TexturMapping for this MappingChannel
: since 6.0