---
title: "Material"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render.ChangeQueue*

Representation of a Material through the change queue
```cs
public class Material
```
## Properties

uint Id
: Get the material ID (crc)
: since 6.0

int MeshIndex
: Get mesh index
: since 6.0

uint MeshInstanceId
: Get the material InstanceAncestry
: since 6.0