---
title: "Skylight"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.ChangeQueue*

ChangeQueue skylight
```cs
public class Skylight
```
## Properties

bool Enabled
: Return True if skylight is enabled
: since 6.0

double ShadowIntensity
: Get shadow intensity for skylight
: since 6.0

bool UsesCustomEnvironment
: Return True if skylight uses custom environment
: since 6.0
## Methods

string ToString()
: Textual representation of Skylight
: since (unknown)