---
title: "Arrowhead"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Geometry*

Arrowhead used by annotation
```cs
public class Arrowhead
```
## Constructors

Arrowhead()
: Constructor
: since 6.0

Arrowhead(ArrowType arrowType,Guid blockId)
: Constructor
: since 6.0
## Properties

ArrowType ArrowType
: Type of arrowhead used by annotation
: since 6.0

Guid BlockId
: Id of block used for user-defined arrowhead
: since 6.0