---
title: "BrepRegionFaceSide"
date: 2020-03-11 15:29:43Z
draft: false
---

*Namespace: Rhino.Geometry*

Represents a side of a  entity.
```cs
public class BrepRegionFaceSide : Runtime.CommonObject
```
## Properties

Brep Brep
: The brep this side belongs to.

BrepFace Face
: Gets the face this side belongs to.

BrepRegion Region
: The region this side belongs to.

bool SurfaceNormalPointsIntoRegion
: Gets True if BrepFace's surface normal points into region; False otherwise.