---
title: "Centermark"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Geometry*

Represents a centermark
```cs
[Serializable]
public class Centermark : Dimension
```
## Constructors

Centermark()
:
: since 6.0
## Methods

static Centermark Create(DimensionStyle dimStyle,Plane plane,Point3d centerpoint,double radius)
: Create a new centermark
: since 6.0