---
title: "CurveProxy"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Geometry*

Provides strongly-typed access to Brep edges.
```cs
public class CurveProxy : Curve
```
## Properties

bool ProxyCurveIsReversed
: True if "this" is a curve is reversed from the "real" curve geometry
: since 5.10