---
title: "InvalidDimensionStyleIdException"
date: 2020-03-11 15:29:43Z
draft: false
---

*Namespace: Rhino.Geometry*

General exception that can be thrown by annotations
```cs
public class InvalidDimensionStyleIdException : InvalidOperationException
```
## Constructors

InvalidDimensionStyleIdException(string msg)
:
: since 6.0