---
title: "Point3dGrid"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Geometry*

Represents a rectangular grid of 3D points.
```cs
[Serializable]
public class Point3dGrid : GeometryBase
```
## Constructors

Point3dGrid()
: Initializes a rectangular grid of points, with no points in it.

Point3dGrid(int rows,int columns)
: Initializes a rectangular grid of points with a given number of columns and rows.