---
title: "Point"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Geometry*

Represents a geometric point.
   This is fundamentally a class that derives from
    and contains a single  location.
```cs
[Serializable]
public class Point : GeometryBase
```
## Constructors

Point(Point3d location)
: Initializes a new point instance with a location.
## Properties

Point3d Location
: Gets or sets the location (position) of this point.