---
title: "SubDComponent"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Geometry*

A part of SubD geometry. Common base class for vertices, faces, and edges
```cs
public class SubDComponent
```
## Properties

uint Id
: Unique id within the parent SubD for this item
: since 7.0

SubD ParentSubD
: SubD that this component belonds to
: since 7.0