---
title: "SubDEdge"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Geometry*

Single edge of a SubD
```cs
public class SubDEdge : SubDComponent
```
## Properties

Line ControlNetLine
: Line representing the control net end points
: since 7.0

int FaceCount
: Number of faces for this edge
: since 7.0

SubDEdgeTag Tag
: identifies the type of subdivision edge
: since 7.0

SubDVertex VertexFrom
: Start vertex for this edge
: since 7.0

SubDVertex VertexTo
: End vertex for this edge
: since 7.0
## Methods

SubDFace FaceAt(int index)
: Retrieve a SubDFace from this edge
: since 7.0

NurbsCurve ToNurbsCurve(bool clampEnds)
: Get a cubic, uniform, nonrational, NURBS curve that is on the
     edge's limit curve.
: since 7.0