---
title: "AngularDimensionObject"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects*

Rhino Object that represents an angular dimension geometry and attributes
```cs
public class AngularDimensionObject : DimensionObject
```
## Properties

AngularDimension AngularDimensionGeometry
: Get the dimension geometry for this object.
: since 6.0