---
title: "BrepObject"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

Represents a brep in a document.
```cs
public class BrepObject : RhinoObject
```
## Properties

Brep BrepGeometry
: Gets the brep geometry linked with this object.
## Methods

Brep DuplicateBrepGeometry()
: Constructs a new deep copy of the brep geometry.
: Returns - The copy of the geometry.