---
title: "CentermarkObject"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

Rhino Object that represents a centermark geometry and attributes
```cs
public class CentermarkObject : DimensionObject
```
## Properties

Centermark CentermarkGeometry
: Get the dimension geometry for this object.
: since 6.0