---
title: "CurveObject"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

A Rhino Object that represents curve geometry and attributes
```cs
public class CurveObject : RhinoObject
```
## Properties

Curve CurveGeometry
:
## Methods

Curve DuplicateCurveGeometry()
: