---
title: "Defaults"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects*

```cs
public class Defaults
```
## Properties

static HatchPattern Dash
:
: since 6.0

static HatchPattern Grid
:
: since 6.0

static HatchPattern Grid60
:
: since 6.0

static HatchPattern Hatch1
:
: since 6.0

static HatchPattern Hatch2
:
: since 6.0

static HatchPattern Hatch3
:
: since 6.0

static HatchPattern Plus
:
: since 6.0

static HatchPattern Solid
:
: since 6.0

static HatchPattern Squares
:
: since 6.0