---
title: "DimensionObject"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

Rhino Object that represents dimension geometry and attributes
```cs
public class DimensionObject : AnnotationObjectBase
```
## Properties

DimensionStyle DimensionStyle
: Gets the
     associated with this OrdinateDimensionObject.
: since 6.0