---
title: "ExtrusionObject"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

```cs
public class ExtrusionObject : RhinoObject
```
## Properties

Extrusion ExtrusionGeometry
:
## Methods

Extrusion DuplicateExtrusionGeometry()
: