---
title: "FontQuartet"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

```cs
public class FontQuartet
```
## Properties

bool HasBoldFont
:
: since 6.7

bool HasBoldItalicFont
:
: since 6.7

bool HasItalicFont
:
: since 6.7

bool HasRegularFont
:
: since 6.7

string QuartetName
:
: since 6.7
## Methods

string ToString()
:
: since (unknown)