---
title: "LeaderObject"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects*

Rhino Object that represents leader geometry and attributes
```cs
public class LeaderObject : AnnotationObjectBase
```
## Properties

Leader LeaderGeometry
: Get the leader geometry for this object.
: since 6.0