---
title: "LightObject"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects*

```cs
public class LightObject : RhinoObject
```
## Properties

ModelComponentType ComponentType
:
: since 6.0

Light LightGeometry
:
## Methods

Light DuplicateLightGeometry()
: