---
title: "LinearDimensionObject"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

Rhino Object that represents a linear dimension geometry and attributes
```cs
public class LinearDimensionObject : DimensionObject
```
## Properties

LinearDimension LinearDimensionGeometry
: Get the dimension geometry for this object.
: since 6.0