---
title: "OrdinateDimensionObject"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

Rhino Object that represents an ordinate dimension geometry and attributes
```cs
public class OrdinateDimensionObject : DimensionObject
```
## Properties

OrdinateDimension OrdinateDimensionGeometry
: Get the dimension geometry for this object.
: since 6.0