---
title: "PointCloudObject"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects*

```cs
public class PointCloudObject : RhinoObject
```
## Properties

PointCloud PointCloudGeometry
:
## Methods

PointCloud DuplicatePointCloudGeometry()
: