---
title: "PointObject"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects*

```cs
public class PointObject : RhinoObject
```
## Properties

Point PointGeometry
:
## Methods

Point DuplicatePointGeometry()
: