---
title: "ProxyObject"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects*

A proxy object (not saved in files)
```cs
public class ProxyObject : RhinoObject
```
## Methods

int CreateMeshes(MeshType meshType,MeshingParameters parameters,bool ignoreCustomParameters)
:
: since 7.0

Mesh[] GetMeshes(MeshType meshType)
:
: since 7.0