---
title: "RadialDimensionObject"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

Rhino Object that represents a radial dimension geometry and attributes
```cs
public class RadialDimensionObject : DimensionObject
```
## Properties

RadialDimension RadialDimensionGeometry
: Get the dimension geometry for this object.
: since 6.0