---
title: "RhinoObjectSelectionEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

```cs
public class RhinoObjectSelectionEventArgs : EventArgs
```
## Properties

RhinoDoc Document
:

RhinoObject[] RhinoObjects
:

bool Selected
: Returns True if objects are being selected.
       Returns False if objects are being deseleced.