---
title: "RhinoReplaceObjectEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

```cs
public class RhinoReplaceObjectEventArgs : EventArgs
```
## Properties

RhinoDoc Document
:

RhinoObject NewRhinoObject
:

Guid ObjectId
:

RhinoObject OldRhinoObject
: