---
title: "RhinoObjectEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

```cs
public class RhinoObjectEventArgs : EventArgs
```
## Properties

Guid ObjectId
:

RhinoObject TheObject
: