---
title: "RhinoDeselectAllObjectsEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

```cs
public class RhinoDeselectAllObjectsEventArgs : EventArgs
```
## Properties

RhinoDoc Document
:

int ObjectCount
: