---
title: "RhinoTransformObjectsEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

EventArgs passed to RhinoDoc.BeforeTransform.
```cs
public class RhinoTransformObjectsEventArgs : EventArgs
```
## Properties

int ObjectCount
:
: since 5.10

RhinoObject[] Objects
:
: since 5.10

bool ObjectsWillBeCopied
:
: since 5.10

Transform Transform
:
: since 5.10