---
title: "RhinoModifyObjectAttributesEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

```cs
public class RhinoModifyObjectAttributesEventArgs : EventArgs
```
## Properties

RhinoDoc Document
:

ObjectAttributes NewAttributes
:

ObjectAttributes OldAttributes
:

RhinoObject RhinoObject
: