---
title: "SurfaceObject"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects*

Represents a surface in a document.
```cs
public class SurfaceObject : RhinoObject
```
## Properties

Surface SurfaceGeometry
: Gets the surface geometry linked with this object.
## Methods

Surface DuplicateSurfaceGeometry()
: Constructs a new deep copy of the surface geometry.
: Returns - The copy of the geometry.