---
title: "TextObject"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects*

Rhino Object that represents text geometry and attributes
```cs
public class TextObject : AnnotationObjectBase
```
## Properties

TextEntity TextGeometry
: Get the text geometry for this object.