---
title: "MostRecentCommandDescription"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Commands*

Stores the macro and display string of the most recent command.
```cs
public class MostRecentCommandDescription
```
## Properties

string DisplayString
:

string Macro
: