---
title: "UndoRedoEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Commands*

```cs
public class UndoRedoEventArgs : EventArgs
```
## Properties

Guid CommandId
:

bool IsBeginRecording
:

bool IsBeginRedo
:

bool IsBeginUndo
:

bool IsEndRecording
:

bool IsEndRedo
:

bool IsEndUndo
:

bool IsPurgeRecord
:

uint UndoSerialNumber
: