---
title: "CustomGripObject"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects.Custom*

```cs
public class CustomGripObject : GripObject, IDisposable
```
## Constructors

CustomGripObject()
:
## Properties

int Index
:

Point3d OriginalLocation
:

double Weight
:
## Methods

void Dispose()
:

void NewLocation()
: