---
title: "CustomPointObject"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects.Custom*

```cs
public class CustomPointObject : PointObject, IDisposable
```
## Methods

void Dispose()
:
: since 5.6