---
title: "CustomMeshObject"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects.Custom*

```cs
public class CustomMeshObject : MeshObject, IDisposable
```
## Methods

void Dispose()
: