---
title: "CustomCurveObject"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects.Custom*

```cs
public class CustomCurveObject : CurveObject, IDisposable
```
## Methods

void Dispose()
: