---
title: "UnknownUserData"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.DocObjects.Custom*

Represents user data with unknown origin.
```cs
public class UnknownUserData : UserData
```
## Constructors

UnknownUserData(IntPtr pointerNativeUserData)
: Constructs a new unknown data entity.