---
title: "ContentCollectionIterator"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class ContentCollectionIterator : IDisposable
```
## Constructors

ContentCollectionIterator(IntPtr pCollection)
:
: since 6.0
## Properties

IntPtr CppPointer
:
: since 6.0
## Methods

void DeleteThis()
:
: since 6.0

void Dispose()
:
: since 6.0

RenderContent First()
:
: since 6.0

RenderContent Next()
:
: since 6.0