---
title: "ContentUuids"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render*

Content Guids of RenderContent provided by the RDK SDK.

   These Guids can be used to check against RenderContent.TypeId.
```cs
public class ContentUuids
```
## Properties

static Guid AdvancedDotTextureType
:
: since 6.0

static Guid BasicEnvironmentCCI
:
: since 6.0

static Guid BasicEnvironmentType
:
: since 6.0

static Guid BasicMaterialCCI
:
: since 6.0

static Guid BasicMaterialType
:
: since 6.0

static Guid BitmapTextureType
:
: since 6.0

static Guid BlendMaterialCCI
:
: since 6.0

static Guid BlendMaterialType
:
: since 6.0

static Guid BlendTextureType
:
: since 6.0

static Guid CompositeMaterialCCI
:
: since 6.0

static Guid CompositeMaterialType
:
: since 6.0

static Guid CrossHatchBumpTexture
:
: since 6.0

static Guid CubeMapTextureType
:
: since 6.0

static Guid DefaultEnvironmentInstance
:
: since 6.0

static Guid DefaultMaterialInstance
:
: since 6.0

static Guid DotBumpTexture
:
: since 6.0

static Guid DoubleSidedMaterialType
:
: since 7.0

static Guid ExposureTextureType
:
: since 6.0

static Guid EXRTextureType
:
: since 6.0

static Guid FBmTextureType
:
: since 6.0

static Guid GemMaterialType
:
: since 6.0

static Guid GlassMaterialType
:
: since 6.0

static Guid GradientTextureType
:
: since 6.0

static Guid GraniteTextureType
:
: since 6.0

static Guid GridTextureType
:
: since 6.0

static Guid GritBumpTexture
:
: since 6.0

static Guid HatchBumpTexture
:
: since 6.0

static Guid HDRTextureType
:
: since 6.0

static Guid LeatherBumpTexture
:
: since 6.0

static Guid MarbleTextureType
:
: since 6.0

static Guid MaskTextureType
:
: since 6.0

static Guid MetalMaterialType
:
: since 6.0

static Guid NoiseTextureType
:
: since 6.0

static Guid PaintMaterialType
:
: since 6.0

static Guid PerlinMarbleTextureType
:
: since 6.0

static Guid PerturbingTextureType
:
: since 6.0

static Guid PhysicallyBasedMaterialType
:
: since 7.0

static Guid PictureMaterialType
:
: since 6.0

static Guid PlasterMaterialType
:
: since 6.0

static Guid PlasticMaterialType
:
: since 6.0

static Guid ProjectionChangerTextureType
:
: since 6.0

static Guid RealtimeDisplayMaterialType
:
: since 6.0

static Guid ResampleTextureType
:
: since 6.0

static Guid SimpleBitmapTextureType
:
: since 6.0

static Guid SingleColorTextureType
:
: since 6.0

static Guid SpeckleBumpTexture
:
: since 6.0

static Guid StuccoTextureType
:
: since 6.0

static Guid Texture2DCheckerTextureType
:
: since 6.0

static Guid Texture3DCheckerTextureType
:
: since 6.0

static Guid TextureAdjustmentTextureType
:
: since 6.0

static Guid TileTextureType
:
: since 6.0

static Guid TurbulenceTextureType
:
: since 6.0

static Guid WavesTextureType
:
: since 6.0

static Guid WoodBumpTexture
:
: since 6.0

static Guid WoodTextureType
:
: since 6.0