---
title: "ConvertibleExtensions"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

Extension methods for IConvertible that work when
   an object is a Variant.
```cs
public class ConvertibleExtensions
```
## Methods

static Color4f ToColor4f(IConvertible variant)
:
: since 6.0

static Vector2d ToVector2d(IConvertible variant)
:
: since 6.0

static Vector3d ToVector3d(IConvertible variant)
:
: since 6.0