---
title: "CustomEvent"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

This class contains the event for CustomEvents that are fired from RDK .
```cs
public class CustomEvent
```
## Events

static OnCustomEvent
: This event is raised when a Custom Event is triggered in rdk.
: since 7.0