---
title: "DecalCreateParams"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

Used by RhinoObject.AddDecal() to create and add a decal
```cs
public class DecalCreateParams
```
## Properties

DecalMapping DecalMapping
:
: since 6.0

DecalProjection DecalProjection
:
: since 6.0

double EndLatitude
:
: since 6.0

double EndLongitude
:
: since 6.0

double Height
:
: since 6.0

bool MapToInside
:
: since 6.0

double MaxU
:
: since 6.0

double MaxV
:
: since 6.0

double MinU
:
: since 6.0

double MinV
:
: since 6.0

Point3d Origin
:
: since 6.0

double Radius
:
: since 6.0

double StartLatitude
:
: since 6.0

double StartLongitude
:
: since 6.0

Guid TextureInstanceId
:
: since 6.0

double Transparency
:
: since 6.0

Vector3d VectorAcross
:
: since 6.0

Vector3d VectorUp
:
: since 6.0