---
title: "Decals"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render*

Represents all the decals of an object.
```cs
public class Decals : IEnumerable<Decal>
```
## Methods

uint Add(Decal decal)
: Add a new Decal to the decals list, use Decal.Create to create
     a new decal instance to add.
: since 5.10

void Clear()
:
: since 5.10

IEnumerator<Decal> GetEnumerator()
:
: since 5.10

bool Remove(Decal decal)
:
: since 5.10