---
title: "DisplayPipelineSettingsChangedEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class DisplayPipelineSettingsChangedEventArgs : EventArgs
```
## Constructors

DisplayPipelineSettingsChangedEventArgs(DisplayPipelineAttributes dpa)
:
: since 6.0
## Properties

DisplayPipelineAttributes Attributes
:
: since 6.0