---
title: "Dithering"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render*

This is the interface to linear workflow settings.
```cs
public class Dithering : DocumentOrFreeFloatingBase
```
## Constructors

Dithering()
: Create an utility object not associated with any document
: since 6.0

Dithering(Dithering d)
: Create an utility object not associated with any document from another object
: since 6.0
## Properties

Methods Method
:
: since 6.0
## Methods

void CopyFrom(FreeFloatingBase src)
:
: since 6.0