---
title: "DrawMiddlegroundEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class DrawMiddlegroundEventArgs : EventArgs
```
## Constructors

DrawMiddlegroundEventArgs(DisplayPipeline dp)
:
: since 6.0
## Properties

DisplayPipeline Pipeline
:
: since 6.0