---
title: "FreeFloatingBase"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render*

Base class for Rhino.Render objects that are owned by the document, or can be delivered separately
   from other functions.  In general, you cannot create these objects yourself.
```cs
public class FreeFloatingBase
```
## Methods

void CopyFrom(FreeFloatingBase src)
: Copy from another object
: since 6.0