---
title: "HudMaxPassesChangedEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class HudMaxPassesChangedEventArgs : EventArgs
```
## Constructors

HudMaxPassesChangedEventArgs(int mp)
:
: since 6.0
## Properties

int MaxPasses
:
: since 6.0