---
title: "ImageFileEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class ImageFileEventArgs : EventArgs
```
## Properties

int EllapsedTime
:
: since 5.11

ImageFileEvent Event
:
: since 5.11

string FileName
:
: since 5.11

string RenderEngine
:
: since 5.11

Guid RenderEngineId
:
: since 5.11

Guid SessionId
:
: since 5.11