---
title: "InitFramebufferEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class InitFramebufferEventArgs : EventArgs
```
## Constructors

InitFramebufferEventArgs(DisplayPipeline dp)
:
: since 6.0
## Properties

DisplayPipeline Pipeline
:
: since 6.0