---
title: "LightArray"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class LightArray : IDisposable
```
## Constructors

LightArray()
:
: since 6.0

LightArray(IntPtr pLightArray)
:
: since 6.0
## Properties

IntPtr CppPointer
:
: since 6.0
## Methods

void Append(Light light)
:
: since 6.0

int Count()
:
: since 6.0

void Dispose()
:
: since 6.0

Rhino.Geometry.Light ElementAt(int index)
:
: since 6.0