---
title: "MetaDataProxy"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

ProxyClass for MetaData
```cs
public class MetaDataProxy : IDisposable
```
## Constructors

MetaDataProxy()
: Constructor for MetaDataProxy
: since 6.8
## Properties

IntPtr CppPointer
: MetaDataProxy c++ pointer
: since 6.8
## Methods

void Dispose()
: Dispose for MetaDataProxy
: since 6.8

void SetContentInstanceId(Guid uuid)
: Set Content instance id for meta data
: since 6.8