---
title: "NamedValue"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class NamedValue
```
## Constructors

NamedValue(string name,object value)
:
: since 5.1
## Properties

string Name
:
: since 5.1

object Value
:
: since 5.1