---
title: "ParametersNames"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class ParametersNames
```
## Properties

static string AmbientOcclusion
:
: since 7.0

static string Anisotropic
:
: since 7.0

static string AnisotropicRotation
:
: since 7.0

static string BaseColor
:
: since 7.0

static string BRDF
:
: since 7.0

static string Bump
:
: since 7.0

static string Clearcoat
:
: since 7.0

static string ClearcoatBump
:
: since 7.0

static string ClearcoatRoughness
:
: since 7.0

static string Displacement
:
: since 7.0

static string Emission
:
: since 7.0

static string Metallic
:
: since 7.0

static string Opacity
:
: since 7.0

static string OpacityIor
:
: since 7.0

static string OpacityRoughness
:
: since 7.0

static string Roughness
:
: since 7.0

static string Sheen
:
: since 7.0

static string SheenTint
:
: since 7.0

static string Specular
:
: since 7.0

static string SpecularTint
:
: since 7.0

static string Subsurface
:
: since 7.0

static string SubsurfaceScatteringColor
:
: since 7.0

static string SubsurfaceScatteringRadius
:
: since 7.0