---
title: "PixelBuffer"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class PixelBuffer
```
## Constructors

PixelBuffer(IntPtr bufferPointer)
: Create a new PixelBuffer pointing to the
     (unmanaged) pixel data buffer behind IntPtr
: since 6.0
## Properties

IntPtr Buffer
:
: since 6.0