---
title: "PreviewLighting"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

PreviewAppearance takes care of constucting and desctrutction of PreviewLight
```cs
public class PreviewLighting
```
## Constructors

PreviewLighting(IntPtr pPreviewLighting)
: Constructor for PreivewLighting
: since 6.0
## Properties

IntPtr CppPointer
: CppPointer for PreivewLighting
: since 6.0
## Methods

string ElementKind()
: ElementKind
: since 6.0

void SetUpPreview(IntPtr sceneServerPointer)
: SetUpPreview
: since 6.0