---
title: "PreviewSceneServer"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

PreviewSceneServer
```cs
public class PreviewSceneServer
```
## Constructors

PreviewSceneServer(IntPtr pPreviewSceneServer)
: Constructor for PreviewSceneServer
: since 6.0
## Properties

IntPtr CppPointer
: The CppPointer of PreviewSceneServer
: since 6.0
## Methods

void ApplyRotation(double X,double Y,IRhRdkPreviewSceneServer_eRotationType type)
: Set Scene Server Rotation
: since 6.0

void Dispose()
: Dispose for PreviewSceneServer
: since 6.0