---
title: "RdkUndo"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

RdkUndo class, which is used to get the
   RdkUndoRecord
```cs
public class RdkUndo : IDisposable
```
## Constructors

RdkUndo(IntPtr pUndoRecord)
: Constructor for RdkUndo
: since 6.11
## Methods

void Dispose()
: Dispose for RdkUndo
: since 6.11

RdkUndoRecord NewUndoRecord()
: Get a new UndoRecord
: since 6.11