---
title: "RdkUndoRecord"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

RdkUndoRecord class
```cs
public class RdkUndoRecord : IDisposable
```
## Constructors

RdkUndoRecord(IntPtr pUndoRecord)
: Constructor for RdkUndoRecord
: since 6.0
## Methods

void Dispose()
: Dispose for RdkUndoRecord
: since 6.0

void SetDescription(String description)
: Set description for RdkUndoRecord
: since 6.0