---
title: "RenderCustomEventArgs"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render*

Used as Rhino.Render Custom Events args.
```cs
public class RenderCustomEventArgs : EventArgs
```
## Properties

IntPtr Argument
: The pointer to the custom event args.
: since 7.0

Guid EventType
: The type of the event.
: since 7.0