---
title: "RenderPlugInList"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class RenderPlugInList : List<RenderPlugInInfo>
```
## Constructors

RenderPlugInList()
:
: since 6.0