---
title: "RenderEnvironmentTable"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class RenderEnvironmentTable : IRenderContentTable<RenderEnvironment>, IEnumerable<RenderEnvironment>, Collections.IRhinoTable<RenderEnvironment>
```
## Properties

int Count
:
: since 5.7
## Methods

bool Add(RenderEnvironment c)
:
: since 6.0

void BeginChange(ChangeContexts changeContext)
:
: since 7.0

void EndChange()
:
: since 7.0

IEnumerator<RenderEnvironment> GetEnumerator()
:
: since 5.7

bool Remove(RenderEnvironment c)
:
: since 6.0