---
title: "RenderPlugInInfo"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class RenderPlugInInfo
```
## Properties

string Name
:
: since 6.0

Guid PlugInId
:
: since 6.0