---
title: "RenderWindowClonedEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class RenderWindowClonedEventArgs : EventArgs
```
## Properties

RenderWindow NewRenderWindow
:
: since 5.11

Guid NewSessionId
:
: since 5.11

RenderWindow OldRenderWindow
:
: since 5.11

Guid OldSessionId
:
: since 5.11