---
title: "RenderContentChangedEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class RenderContentChangedEventArgs : RenderContentEventArgs
```
## Properties

ChangeContexts ChangeContext
:
: since 5.7

RenderContent OldContent
:
: since 6.0