---
title: "RenderContentKindList"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class RenderContentKindList : IDisposable
```
## Constructors

RenderContentKindList()
:
: since 6.7

RenderContentKindList(IntPtr pRdkRenderContentKindList)
:
: since 6.1

RenderContentKindList(RenderContentKindList kind_list)
:
: since 6.7
## Properties

IntPtr CppPointer
:
: since 6.1
## Methods

void Add(RenderContentKind kind)
:
: since 6.7

bool Contains(RenderContentKind kind)
:
: since 6.3

int Count()
:
: since 6.1

void Dispose()
:
: since 6.1

RenderContentKind SingleKind()
:
: since 6.1