---
title: "RenderPropertyChangedEvent"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render*

Used by Rhino.Render object property value has changed events.
```cs
public class RenderPropertyChangedEvent : EventArgs
```
## Properties

int Context
: Optional argument which may specify the property being modified.
: since 5.10

RhinoDoc Document
: The document triggering the event.
: since 5.10