---
title: "SceneServerData"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

The Scene Server Data used by the PreviewSceneServer
```cs
public class SceneServerData
```
## Constructors

SceneServerData(PreviewGeometry geo,PreviewBackground back,PreviewLighting light,SceneServerDataUsage usage)
: Constructor for SceneServerData
: since 6.0
## Properties

IntPtr CppPointer
: The CppPointer of SceneServerData
: since 6.0
## Methods

void Dispose()
: Dispose for SceneServerData
: since 6.0