---
title: "SceneObject"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class SceneObject
```
## Properties

RenderMaterial Material
:
: since 5.1

Mesh Mesh
:
: since 5.1