---
title: "Skylight"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class Skylight : DocumentOrFreeFloatingBase
```
## Constructors

Skylight()
: Create an utility object not associated with any document
: since 6.0

Skylight(Skylight src)
: Create an utility object not associated with any document from another object
: since 6.0
## Events

static Changed
: This event is raised when a Skylight property value is changed.
: since 6.0
## Properties

Guid CustomEnvironment
:
: since 6.0

bool CustomEnvironmentOn
:
: since 6.0

bool Enabled
:
: since 6.0

double ShadowIntensity
:
: since 6.0
## Methods

void CopyFrom(FreeFloatingBase src)
:
: since 6.0