---
title: "SupportOptions"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class SupportOptions
```
## Methods

static bool AlwaysShowSunPreview()
:
: since 6.0

static int AutoSaveKeepAmount()
:
: since 6.0

static bool AutoSaveRenderings()
:
: since 6.0

static bool CheckSupportFilesBeforeRendering()
:
: since 6.0

static bool CombineEditors()
:
: since 6.0

static string CustomLibraryPath()
:
: since 6.0

static string CustomPaths()
:
: since 6.0

static int DarkPreviewCheckerColor()
:
: since 6.0

static bool EnablePreviewJobLog()
:
: since 6.0

static bool HarvestContentParameters()
:
: since 6.0

static int LabelFormatLoc()
:
: since 6.0

static int LabelFormatUtc()
:
: since 6.0

static string LastNavigatedLocation()
:
: since 6.10

static RdkInitialLocation LibrariesInitialLocation()
:
: since 6.0

static string LibrariesInitialLocationCustomFolder()
:
: since 6.0

static int LightPreviewCheckerColor()
:
: since 6.0

static int MaxPreviewCacheMB()
:
: since 6.0

static int MaxPreviewSeconds()
:
: since 6.0

static bool MultithreadedTextureEvaluation()
:
: since 6.0

static bool PreferNativeRenderer()
:
: since 6.0

static string PreferredUnpackFolder()
:
: since 6.0

static bool PreviewCustomRenderMeshes()
:
: since 6.0

static void SetAlwaysShowSunPreview(bool b)
:
: since 6.0

static void SetAutoSaveKeepAmount(int value)
:
: since 6.0

static void SetAutoSaveRenderings(bool b)
:
: since 6.0

static void SetCheckSupportFilesBeforeRendering(bool b)
:
: since 6.0

static void SetCombineEditors(bool b)
:
: since 6.0

static void SetCustomLibraryPath(string path)
:
: since 6.0

static void SetCustomPaths(string path)
:
: since 6.0

static void SetHarvestContentParameters(bool b)
:
: since 6.0

static void SetLabelFormatLoc(int value)
:
: since 6.0

static void SetLabelFormatUtc(int value)
:
: since 6.0

static void SetLastNavigatedLocation(string folder)
:
: since 6.10

static void SetLibrariesInitialLocation(RdkInitialLocation l)
:
: since 6.0

static void SetLibrariesInitialLocationCustomFolder(string path)
:
: since 6.0

static void SetMultithreadedTextureEvaluation(bool b)
:
: since 6.0

static void SetPreferNativeRenderer(bool b)
:
: since 6.0

static void SetPreferredUnpackFolder(string path)
:
: since 6.0

static void SetPreviewCustomRenderMeshes(bool b)
:
: since 6.0

static void SetShowCustom(bool b)
:
: since 6.0

static void SetShowDetailsPanel(bool b)
:
: since 6.0

static void SetShowDocuments(bool b)
:
: since 6.0

static void SetShowRenderContent(bool b)
:
: since 6.0

static void SetSupportSharedUIs(bool b)
:
: since 6.0

static void SetTextureSize(RdkTextureSize size,bool bSendEvent)
:
: since 6.0

static void SetUseDefaultLibraryPath(bool b)
:
: since 6.0

static void SetUsePreviewCache(bool b)
:
: since 6.0

static void SetUseQuickInitialPreview(bool b)
:
: since 6.0

static bool ShowCustom()
:
: since 6.0

static bool ShowDetailsPanel()
:
: since 6.0

static bool ShowDocuments()
:
: since 6.0

static bool ShowRenderContent()
:
: since 6.0

static bool SupportSharedUIs()
:
: since 6.0

static bool SupportSharedUIsNoCache()
:
: since 6.0

static int TextureSize()
:
: since 6.0

static bool UseDefaultLibraryPath()
:
: since 6.0

static bool UsePreview()
:
: since 6.0

static bool UsePreviewCache()
:
: since 6.0

static bool UseQuickInitialPreview()
:
: since 6.0

static bool UseRenderedPreview()
:
: since 6.0