---
title: "TextureGraphInfo"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class TextureGraphInfo : IDisposable
```
## Constructors

TextureGraphInfo()
:
: since 6.3
## Properties

IntPtr CppPointer
:
: since 6.3
## Methods

Axis ActiveAxis()
:
: since 6.3

Channel ActiveChannel()
:
: since 6.3

double AmountU()
:
: since 6.3

double AmountV()
:
: since 6.3

double AmountW()
:
: since 6.3

void Dispose()
:
: since 6.3

void SetActiveAxis(Axis axis)
:
: since 6.3

void SetActiveChannel(Channel channel)
:
: since 6.3

void SetAmountU(double d)
:
: since 6.3

void SetAmountV(double d)
:
: since 6.3

void SetAmountW(double d)
:
: since 6.3