---
title: "TexturedFloat"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

float specialization of TexturedValue.
```cs
public class TexturedFloat : TexturedValue<float>
```
## Constructors

TexturedFloat(string name,float value,bool on,float amount)
:
: since 6.12