---
title: "TexturedColor"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

Color4f specialization of TexturedValue.
```cs
public class TexturedColor : TexturedValue<Display.Color4f>
```
## Constructors

TexturedColor(string name,Color4f value,bool on,float amount)
:
: since 6.12