---
title: "TexturedValue"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

Generic class to help holding on to related values. This can be
   used to get data from textured content fields with the
   HandleTexturedValue function.
```cs
public class TexturedValue
```
## Constructors

TexturedValue(string name,T value,bool on,float amount)
:
: since (unknown)