---
title: "TwoColorRenderTexture"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

```cs
public class TwoColorRenderTexture : RenderTexture
```
## Properties

Color4f Color1
:
: since 5.1

Color4f Color2
:
: since 5.1

bool SuperSample
:
: since 5.1

bool SwapColors
:
: since 5.1

double Texture1Amount
:
: since 5.1

bool Texture1On
:
: since 5.1

double Texture2Amount
:
: since 5.1

bool Texture2On
:
: since 5.1