---
title: "UndoRedo"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Render*

This class contains the event for UndoRedoChanged that is fired from RDK .
```cs
public class UndoRedo
```
## Events

static UndoRedoChanged
: Called after undo or redo has occurred for document settings.
: since 6.0

static UndoRedoEndedChanged
: This event is raised when undo/redo ends in rdk.
: since 7.0