---
title: "BinaryArchiveException"
date: 2020-03-11 15:29:43Z
draft: false
---

*Namespace: Rhino.FileIO*

Thrown by BinaryArchiveReader and BinaryArchiveWriter classes when
   an IO error has occured.
```cs
public class BinaryArchiveException : System.IO.IOException
```
## Constructors

BinaryArchiveException(string message)
: Initializes a new instance of the  class.