---
title: "BinaryArchiveFile"
date: 2020-03-11 15:29:43Z
draft: false
---

*Namespace: Rhino.FileIO*

```cs
public class BinaryArchiveFile : IDisposable
```
## Constructors

BinaryArchiveFile(string filename,BinaryArchiveMode mode)
:
: since 5.1
## Properties

BinaryArchiveReader Reader
:
: since 5.1

BinaryArchiveWriter Writer
:
: since 5.1
## Methods

void Close()
:
: since 5.1

void Dispose()
: Actively reclaims unmanaged resources that this instance uses.
: since 5.1

bool Open()
:
: since 5.1