---
title: "FileType"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.FileIO*

```cs
public class FileType
```
## Constructors

FileType(string extension,string description)
:
## Properties

string Description
:

string Extension
: