---
title: "FilePly"
date: 2020-03-11 15:29:43Z
draft: false
---

*Namespace: Rhino.FileIO*

Support for ply file format
```cs
public class FilePly
```
## Methods

static WriteFileResult Write(String filename,RhinoDoc doc,FilePlyWriteOptions options)
: Write a ply file based on the contents of a RhinoDoc
: since 7.0