---
title: "FilePlyWriteOptions"
date: 2020-03-11 15:29:43Z
draft: false
---

*Namespace: Rhino.FileIO*

```cs
public class FilePlyWriteOptions
```
## Constructors

FilePlyWriteOptions(FileWriteOptions writeOptions)
:
: since 7.0
## Properties

bool ExportASCII
: Determines whether to export as Ascii.
: since 7.0

bool ExportColors
: Determines whether to export vertex colors.
: since 7.0

bool ExportMaterial
: Determines whether to export a material.
: since 7.0

bool ExportNormals
: Determines whether to export vertex normals.
: since 7.0

MeshingParameters MeshingParameters
:
: since 7.0

bool UseSimpleDialog
: Determines whether to use the simple or detailed meshing dialog.
: since 7.0