---
title: "FilePdfEventArgs"
date: 2020-03-11 15:29:43Z
draft: false
---

*Namespace: Rhino.FileIO*

Used for events that are fired while constructing/saving a Pdf
```cs
public class FilePdfEventArgs : EventArgs
```
## Properties

FilePdf Pdf
: The document that is about to be written
: since 6.0