---
title: "File3dmPlugInData"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.FileIO*

Custom data in the file supplied by a plug-in
```cs
public class File3dmPlugInData
```
## Properties

Guid PlugInId
: Plug-in this data is associated with