---
title: "ImageFile"
date: 2020-03-11 15:29:43Z
draft: false
---

*Namespace: Rhino.FileIO*

Support functions for image files
```cs
public class ImageFile
```
## Methods

static bool SupportsAlphaChannel(string filename)
: Returns True if file at given path is an image file and that file format supports
     an alpha channel
: since 6.0