---
title: "SerializationOptions"
date: 2020-03-11 15:29:43Z
draft: false
---

*Namespace: Rhino.FileIO*

Contains options for serializing -or storing- data,
   such as Rhino version and user data.
```cs
public class SerializationOptions
```
## Constructors

SerializationOptions()
: Initializes a new instance of the  class.
## Properties

int RhinoVersion
: Gets or sets a value indicating the Rhino version.

bool WriteUserData
: Gets or sets a value indicating whether to write user data.