---
title: "GumballAppearanceSettings"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI.Gumball*

```cs
public class GumballAppearanceSettings
```
## Constructors

GumballAppearanceSettings()
:
## Properties

int ArcThickness
: in pixels.

int ArrowHeadLength
: in pixels.

int ArrowHeadWidth
: in pixels.

int AxisThickness
: in pixels.

Color ColorMenuButton
:

Color ColorX
: Default is Red.

Color ColorY
: Default is Green.

Color ColorZ
: Default is Blue.

int FreeTranslate
: When FreeTranslate is 1, the center translation control can be dragged
     in any direction and moves the object the gumball controls. When
     FreeTranslate is 2, the center translation control can be dragged in any
     direction and moves the object the gumball itself. The default value is 2.

int MenuDistance
: Distance of menu ball from center.

bool MenuEnabled
: When MenuEnabled is true, the menu "button" is drawn on the gumball.
     The default setting is true.

int MenuSize
: Radius of menu circle.

int PlanarTranslationGripCorner
: in pixels.

int PlanarTranslationGripSize
: in pixels.

int Radius
: in pixels.

bool RelocateEnabled
: When RelocateEnabled is true, the user can reposition the gumball by
     tapping the control key while dragging.  Once the repostion drag is
     terminated by releasing the/ mouse button, ordinary editing resumes.
     The default setting is true.

bool RotateXEnabled
: When RotateX is true, the X rotation control is available. The default
     setting is true.

bool RotateYEnabled
: When RotateY is true, the Y rotation control is available. The default
     setting is true.

bool RotateZEnabled
: When RotateZ is true, the Z rotation control is available. The default
     setting is true.

int ScaleGripSize
: in pixels.

bool ScaleXEnabled
: When ScaleXEnabled is true, the X scale control is available. The
     default setting is true.

bool ScaleYEnabled
: When ScaleYEnabled is true, the Y scale control is available. The
     default setting is true.

bool ScaleZEnabled
: When ScaleZEnabled is true, the Z scale control is available. The
     default setting is true.

bool TranslateXEnabled
: TranslateXEnabled is true, the X axis translation control is available.
     The default setting is true.

bool TranslateXYEnabled
: When TranslateXY is true, the XY plane translation control is available
     in appropriate views. The default setting is true.

bool TranslateYEnabled
: TranslateYEnabled is true, the Y axis translation control is available.
     The default setting is true.

bool TranslateYZEnabled
: When TranslateYZ is true, the YZ plane translation control is available
     in appropriate views. The default setting is true.

bool TranslateZEnabled
: TranslateZEnabled is true, the Z axis translation control is available.
     The default setting is true.

bool TranslateZXEnabled
: When TranslateZX is true, the ZX plane translation control is available
     in appropriate views. The default setting is true.