---
title: "GumballPickResult"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI.Gumball*

```cs
public class GumballPickResult
```
## Properties

GumballMode Mode
:
## Methods

void SetToDefault()
: