---
title: "AppearanceSettingsState"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.ApplicationSettings*

Represents a snapshot of the values in .
```cs
public class AppearanceSettingsState
```
## Properties

Color CommandPromptBackgroundColor
: Gets or sets the comand prompt background color.

Color CommandPromptHypertextColor
: Gets or sets the comand prompt hypertext color.

Color CommandPromptTextColor
: Gets or sets the command prompt text color.

Color CrosshairColor
: Gets or sets the crosshair color.

Color CurrentLayerBackgroundColor
: Gets or sets the color used by the layer manager dialog as the background color for the current layer.

string DefaultFontFaceName
: Gets or sets the name of the default font face.

Color DefaultLayerColor
: Gets or sets the default layer color.

Color DefaultObjectColor
: Gets or sets the default object color.

bool EchoCommandsToHistoryWindow
: Gets or sets a value that determines if command names are written to the history window.

bool EchoPromptsToHistoryWindow
: Gets or sets a value that determines if prompt messages are written to the history window.

Color FeedbackColor
: Gets or sets the feedback color.

Color FrameBackgroundColor
: Gets or sets the frame background color.

Color GridThickLineColor
: Gets or sets the color of the thick line in the grid.

Color GridThinLineColor
: Gets or sets the color of the thin line in the grid.

Color GridXAxisLineColor
: Gets or sets the color of X axis line in the grid.

Color GridYAxisLineColor
: Gets or sets the color of Y axis line in the grid.

Color GridZAxisLineColor
: Gets or sets the color of Z axis line in the grid.

Color LockedObjectColor
: Gets or sets the color used to draw locked objects.

Color PageviewPaperColor
: CRhinoPageView paper background. A rectangle is drawn into the background
    of page views to represent the printed area. The alpha portion of the color
    is used to draw the paper blended into the background

Color SelectedObjectColor
: The color used to draw selected objects.
    The default is yellow, but this can be customized by the user.

bool ShowCrosshairs
: Gets or sets a value that determines if cross hairs are visible.

bool ShowFullPathInTitleBar
: Gets or sets a value that determines if the full path of the document is shown in the Rhino title bar.

Color TrackingColor
: Gets or sets the tracking color.

Color ViewportBackgroundColor
: Gets or sets the viewport background color.

Color WorldCoordIconXAxisColor
: Gets or sets the color of the world X axis of the world coordinates icon,
     appearing usually bottom left in viewports.

Color WorldCoordIconYAxisColor
: Gets or sets the color of the world Y axis of the world coordinate icon,
     appearing usually bottom left in viewports.

Color WorldCoordIconZAxisColor
: Gets or sets the color of the world Z axis of the world coordinate icon,
     appearing usually bottom left in viewports.