---
title: "ColorStop"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Display*

Combination of a color and position. Used in defining gradient fills
## Constructors

ColorStop(Color color,double t)
: Create color stop from a color and position
: since 7.0
## Properties

Color Color
:
: since 7.0

double Position
: Parameter that Color is defined at
: since 7.0