---
title: "CullObjectEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Display*

```cs
public class CullObjectEventArgs : DrawEventArgs
```
## Properties

bool CullObject
:
: since 5.3

RhinoObject RhinoObject
:
: since 5.3

uint RhinoObjectSerialNumber
: Gets the rhino object runtime serial number.
: since 6.14