---
title: "DisplayEngine"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.Display*

```cs
public class DisplayEngine : IDisposable
```
## Methods

void Dispose()
: Actively reclaims unmanaged resources that this instance uses.
: since 6.0