---
title: "DisplayConduit"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.Display*

```cs
public class DisplayConduit
```
## Properties

bool Enabled
:

ActiveSpace SpaceFilter
: If you want this conduit to only work in a specific space (model or page),
     then set this filter to that specific space. The default is None meaning
     no filter is applied
: since 6.0