---
title: "DisplayModeChangedEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Display*

```cs
public class DisplayModeChangedEventArgs : EventArgs
```
## Properties

Guid ChangedDisplayModeId
:
: since 6.18

Guid OldDisplayModeId
:
: since 6.18

RhinoDoc RhinoDoc
:
: since 6.18

RhinoViewport Viewport
:
: since 6.18