---
title: "DrawObjectEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Display*

```cs
public class DrawObjectEventArgs : DrawEventArgs
```
## Properties

bool DrawObject
:

RhinoObject RhinoObject
: