---
title: "DrawEventArgs"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.Display*

```cs
public class DrawEventArgs : EventArgs
```
## Properties

DisplayPipeline Display
:

RhinoDoc RhinoDoc
:

RhinoViewport Viewport
: