---
title: "DrawForegroundEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Display*

```cs
public class DrawForegroundEventArgs : DrawEventArgs
```
## Properties

bool DrawWorldAxes
:

bool WorldAxesDrawn
: