---
title: "InitFrameBufferEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Display*

```cs
public class InitFrameBufferEventArgs : EventArgs
```
## Methods

void SetFill(Color color)
:
: since 6.18

void SetFill(Color top,Color bottom)
:
: since 6.18

void SetFill(Color topLeft,Color bottomLeft,Color topRight,Color bottomRight)
:
: since 6.18