---
title: "MeshDisplayAttributes"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Display*

```cs
public class MeshDisplayAttributes
```
## Properties

Color AllMeshWiresColor
: Color.Empty means that we are NOT using a single color for all mesh wires.

bool HighlightMeshes
:

int MeshWireThickness
:

bool ShowMeshVertices
:

bool ShowMeshWires
: