---
title: "ViewDisplayAttributes"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.Display*

```cs
public class ViewDisplayAttributes
```
## Properties

bool BlendGrid
:

bool DrawGrid
:

bool DrawGridAxes
:

bool DrawTransparentGridPlane
:

bool DrawWorldAxes
:

bool DrawZAxis
:

double HorizontalViewportScale
:

bool ShowGridOnTop
:

bool UseDocumentGrid
:

double VerticalViewportScale
:

Color WorldAxisColorX
:

Color WorldAxisColorY
:

Color WorldAxisColorZ
: