---
title: "GetPointMouseEventArgs"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.Input.Custom*

Arguments for mouse information during point getting.
```cs
public class GetPointMouseEventArgs : EventArgs
```
## Properties

bool ControlKeyDown
:

bool LeftButtonDown
:

bool MiddleButtonDown
:

Point3d Point
:

bool RightButtonDown
:

bool ShiftKeyDown
:

GetPoint Source
:

RhinoViewport Viewport
:

Point WindowPoint
: