---
title: "GetPointDrawEventArgs"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.Input.Custom*

Arguments for drawing during point getting.
```cs
public class GetPointDrawEventArgs : DrawEventArgs
```
## Properties

Point3d CurrentPoint
:

GetPoint Source
: GetPoint class that this draw event originated from.