---
title: "OptionDouble"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.Input.Custom*

```cs
public class OptionDouble : IDisposable
```
## Constructors

OptionDouble(double initialValue)
:

OptionDouble(double initialValue,bool setLowerLimit,double limit)
: Initializes a new instance of the double option class.

OptionDouble(double initialValue,double lowerLimit,double upperLimit)
: Initializes a new instance of the  class with lower and upper limits.
## Properties

double CurrentValue
:

double InitialValue
:
## Methods

void Dispose()
: