---
title: "OptionColor"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.Input.Custom*

```cs
public class OptionColor : IDisposable
```
## Constructors

OptionColor(Color initialValue)
:
## Properties

Color CurrentValue
:

Color InitialValue
:
## Methods

void Dispose()
: