---
title: "OptionInteger"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.Input.Custom*

```cs
public class OptionInteger : IDisposable
```
## Constructors

OptionInteger(int initialValue)
:

OptionInteger(int initialValue,bool setLowerLimit,int limit)
: Initializes a new instance of the  class.

OptionInteger(int initialValue,int lowerLimit,int upperLimit)
: Initializes a new instance of the  class wiht both lower and upper limits.
## Properties

int CurrentValue
:

int InitialValue
:
## Methods

void Dispose()
: