---
title: "OptionToggle"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.Input.Custom*

```cs
public class OptionToggle : IDisposable
```
## Constructors

OptionToggle(bool initialValue,LocalizeStringPair offValue,LocalizeStringPair onValue)
:

OptionToggle(bool initialValue,string offValue,string onValue)
:
## Properties

bool CurrentValue
:

bool InitialValue
:
## Methods

void Dispose()
: