---
title: "TaskCompleteEventArgs"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.Input.Custom*

```cs
public class TaskCompleteEventArgs : EventArgs
```
## Constructors

TaskCompleteEventArgs(Task task,RhinoDoc doc)
:
: since 6.0
## Properties

RhinoDoc Doc
:
: since 6.0

bool Redraw
:
: since 6.0

Task Task
:
: since 6.0