---
title: "CollapsibleSectionHolderImpl"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI.Controls*

```cs
public class CollapsibleSectionHolderImpl : IMPL_CALLBACKS, IDisposable
```
## Constructors

CollapsibleSectionHolderImpl(ICollapsibleSectionHolder client)
:
: since 6.0
## Properties

IntPtr CppPointer
:
: since 6.0
## Methods

static ICollapsibleSectionHolder Find(IntPtr cpp)
:
: since 6.0

static ICollapsibleSectionHolder NewNativeWrapper(IntPtr cpp)
:
: since 6.0

void Dispose()
:
: since 6.0

bool IsSameObject(IntPtr cpp)
:
: since 6.0