---
title: "UndoRecord"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI.Controls*

Undo Record
```cs
public class UndoRecord : IDisposable
```
## Constructors

UndoRecord(string description,IRdkViewModel viewModel)
: UndoRecord Constructor
: Returns - Return the undo record
: since 6.0
## Methods

void Dispose()
: UndoRecord Dispose
: since 6.0