---
title: "ThumbData"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI.Controls.ThumbnailUI*

```cs
[Obsolete("ThumbData is obsolete", false)]
public class ThumbData
```

PropertyChanged
:
: since 6.0
## Properties

List<ThumbData> Children
:
: since 6.0

RenderContent Content
:
: since 6.0

Guid Id
:
: since 6.0

Bitmap Image
:
: since 6.0

string Intensity
:
: since 6.0

bool InUse
:
: since 6.0

Color4f> InUseColor
:
: since 6.0

string Name
:
: since 6.0

ThumbData Parent
:
: since 6.0

PreviewAppearance PreviewAppearance
:
: since 6.0

bool Selected
:
: since 6.0

List<string> Tags
:
: since 6.0

bool TopLevel
:
: since 6.0

string Type
:
: since 6.0
## Methods

static int GetPreviewHeigth(Sizes thumb_size,Shapes shape)
:
: since 6.0

static int GetPreviewWidth(Sizes thumb_size,Shapes shape)
:
: since 6.0