---
title: "ThumbnailViewModelFactory"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI.Controls.ThumbnailUI*

```cs
[Obsolete("ThumbnailViewModelFactory is obsolete", false)]
public class ThumbnailViewModelFactory : InternalRdkViewModelFactory
```
## Constructors

ThumbnailViewModelFactory()
:
: since 6.0
## Methods

IntPtr Get(Guid id)
:
: since 6.0