---
title: "MeshInterference"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Geometry.Intersect*

Represents an element which is part of a curve region boundary.
## Properties

Point3d[] HitPoints
: Array of hit points where the objects of IndexA and IndexB interfere.
: since 7.0

int IndexA
: The index of the first clashing, or interfering object.
: since 7.0

int IndexB
: The index of the second clashing, or interfering object.
: since 7.0