---
title: "MetaData"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.DataSources*

```cs
public class MetaData : IDisposable
```
## Constructors

MetaData(IntPtr pMetaData)
:
: since 6.0
## Properties

IntPtr CppPointer
:
: since 6.0
## Methods

Guid ContentInstanceId()
:
: since 6.7

void Dispose()
:
: since 6.0

string Geometry()
:
: since 6.0