---
title: "RdkEdit"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.DataSources*

```cs
public class RdkEdit : IDisposable
```
## Constructors

RdkEdit(IntPtr pRdkEdit)
:
: since 6.5
## Properties

IntPtr CppPointer
:
: since 6.5
## Methods

void Dispose()
:
: since 6.5

bool Execute(RenderContentCollection collection)
:
: since 6.5