---
title: "RdkModalEditContentBucket"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.DataSources*

```cs
[Obsolete("RdkModalEditContentBucket is obsolete", false)]
public class RdkModalEditContentBucket : IDisposable
```
## Constructors

RdkModalEditContentBucket(IntPtr pRdkModalEditContentBucket)
:
: since 6.5
## Properties

IntPtr CppPointer
:
: since 6.5
## Methods

RenderContentCollection ContentsIn()
:
: since 6.5

void Dispose()
:
: since 6.5

void SetContentsOut(RenderContentCollection collection)
:
: since 6.5