---
title: "DimStyleTableEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects.Tables*

```cs
public class DimStyleTableEventArgs : EventArgs
```
## Properties

RhinoDoc Document
:
: since 6.0

DimStyleTableEventType EventType
:
: since 6.0

int Index
:
: since 6.0

DimensionStyle NewState
:
: since 6.0

DimensionStyle OldState
:
: since 6.0