---
title: "InstanceDefinitionTableEventArgs"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects.Tables*

```cs
public class InstanceDefinitionTableEventArgs : EventArgs
```
## Properties

RhinoDoc Document
:
: since 5.3

InstanceDefinitionTableEventType EventType
:
: since 5.3

int InstanceDefinitionIndex
:
: since 5.3

InstanceDefinition NewState
:
: since 5.3

InstanceDefinitionGeometry OldState
:
: since 5.3