---
title: "LayerTableEventArgs"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects.Tables*

```cs
public class LayerTableEventArgs : EventArgs
```
## Properties

RhinoDoc Document
:

LayerTableEventType EventType
:

int LayerIndex
:

Layer NewState
:

Layer OldState
: