---
title: "LightTableEventArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects.Tables*

```cs
public class LightTableEventArgs : EventArgs
```
## Properties

RhinoDoc Document
:
: since 5.3

LightTableEventType EventType
:
: since 5.3

int LightIndex
:
: since 5.3

LightObject NewState
:
: since 5.3

Light OldState
:
: since 5.3