---
title: "MaterialTableEventArgs"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects.Tables*

```cs
public class MaterialTableEventArgs : EventArgs
```
## Properties

RhinoDoc Document
:

MaterialTableEventType EventType
:

int Index
:

Material OldSettings
: