---
title: "RhinoDocCommonTable"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.DocObjects.Tables*

```cs
public class RhinoDocCommonTable : CommonComponentTable<T>
```
## Properties

RhinoDoc Document
: Document that owns this table.
: since (unknown)