---
title: "SnapshotTable"
date: 2020-03-11 15:29:46Z
draft: false
---

*Namespace: Rhino.DocObjects.Tables*

All snapshots in a rhino document.
```cs
public class SnapshotTable
```
## Properties

RhinoDoc Document
: Document that owns this table.
: since 6.7

string[] Names
: Array of Snapshot names.
: Returns - A string array with the names of all Snapshots in the document.
: since 6.7