---
title: "Color4fField"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.Fields*

Color4f field value class
```cs
public class Color4fField : Field
```
## Properties

Color SystemColorValue
: Gets or sets the field value
: since 5.1

Color4f Value
: Gets or sets the field value
: since 5.1
## Methods

object ValueAsObject()
:
: since 5.7