---
title: "Point2dField"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.Fields*

Point2d field value class
```cs
public class Point2dField : Field
```
## Properties

Point2d Value
: Gets or sets the field value
: since 5.1
## Methods

object ValueAsObject()
:
: since 5.7