---
title: "Point4dField"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.Fields*

Point4d field value class
```cs
public class Point4dField : Field
```
## Properties

Point4d Value
: Gets or sets the field value
: since 5.1
## Methods

object ValueAsObject()
:
: since 5.7