---
title: "TransformField"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.Fields*

Transform field value class
```cs
public class TransformField : Field
```
## Properties

Transform Value
: Gets or sets the field value
: since 5.1
## Methods

object ValueAsObject()
:
: since 5.7