---
title: "Vector3dField"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.Fields*

Vector3d field value class
```cs
public class Vector3dField : Field
```
## Properties

Vector3d Value
: Gets or sets the field value
: since 5.1
## Methods

object ValueAsObject()
:
: since 5.7