---
title: "Vector2dField"
date: 2020-03-11 15:29:44Z
draft: false
---

*Namespace: Rhino.Render.Fields*

Vector2d field value class
```cs
public class Vector2dField : Field
```
## Properties

Vector2d Value
: Gets or sets the field value
: since 5.1
## Methods

object ValueAsObject()
:
: since 5.7