---
title: "EventInfoArgs"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI.Controls.DataSource*

```cs
public class EventInfoArgs : System.EventArgs
```
## Properties

Guid DataType
:
: since 6.0

IntPtr EventInfoPtr
:
: since 6.0