---
title: "ProviderIds"
date: 2020-03-11 15:29:45Z
draft: false
---

*Namespace: Rhino.UI.Controls.DataSource*

```cs
public class ProviderIds
```
## Properties

static Guid ContentChildSlot
:
: since 6.1

static Guid ContentDatabase
:
: since 6.0

static Guid ContentDisplayCollection
:
: since 6.0

static Guid ContentEditorSettings
:
: since 6.0

static Guid ContentLookup
:
: since 6.0

static Guid ContentParam
:
: since 6.0

static Guid ContentPreviewRendered
:
: since 6.0

static Guid ContentSelection
:
: since 6.0

static Guid ContentUIs
:
: since 6.0

static Guid ContentUpdatePreviewMarkersEventInfo
:
: since 6.0

static Guid CurrentEnvironment
:
: since 6.0

static Guid Decals
:
: since 6.5

static Guid Dithering
:
: since 6.0

static Guid GroundPlane
:
: since 6.0

static Guid ImageFileInfo
:
: since 6.2

static Guid LinearWorkflow
:
: since 6.0

static Guid NamedItem
:
: since 6.10

static Guid NewContentControlAssignBy
:
: since 6.0

static Guid NullGuid
:
: since 6.0

static Guid PreviewSettings
:
: since 6.0

static Guid RdkEdit
:
: since 6.5

static Guid RdkRendering
:
: since 6.8

static Guid RdkRenderingGamma
:
: since 6.8

static Guid RdkRenderingPostEffectDOF
:
: since 6.10

static Guid RdkRenderingPostEffectFog
:
: since 6.10

static Guid RdkRenderingPostEffectGlare
:
: since 6.10

static Guid RdkRenderingPostEffectGlow
:
: since 6.10

static Guid RdkRenderingPostEffects
:
: since 6.8

static Guid RdkRenderingProgress
:
: since 6.8

static Guid RdkRenderingToneMapping
:
: since 6.8

static Guid RhinoSettings
:
: since 6.0

static Guid SelectionNavigator
:
: since 6.0

static Guid Skylight
:
: since 6.0

static Guid Sun
:
: since 6.0

static Guid Undo
:
: since 6.11

static Guid UndoRecord
:
: since 6.0